Compressible/RAE2822_Shock/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    frontandback
    {
        type            empty;
        physicalType    empty;
        nFaces          147510;
        startFace       146815;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          745;
        startFace       294325;
    }
    airfoil
    {
        type            wall;
        physicalType    wall;
        nFaces          447;
        startFace       295070;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          198;
        startFace       295517;
    }
)

// ************************************************************************* //
