Compressible/RAE2822_Shock/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	 2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pOut            1e5;

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pOut;

boundaryField
{    
    frontandback
    {
        type            empty;
    }
    
    inlet
    {
        type            freestreamPressure;
        freestreamValue $pOut;
    }
    
    outlet
    {
        type            waveTransmissive;
        field           p;
        psi             thermo:psi;
        gamma           1.4;
        fieldInf        $pOut;
        lInf            5;
        value           uniform $pOut;
    }
    
    airfoil
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
