Compressible/RAE2822_Shock/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Tinlet          298;

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinlet;

boundaryField
{
    frontandback
    {
        type            empty;
    }
    inlet
    {
        type            inletOutlet;
        inletValue      uniform $Tinlet; // fora do domínio
        value           $inletValue; // dentro do domínio para calcular o zeroGradient 
    }
    outlet
    {
        type            zeroGradient;
    }
    airfoil
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
