Compressible/RAE2822_Shock/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

// alphaT é a condutividade térmica turbulenta cinemática

boundaryField
{
    frontandback
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    airfoil
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
}
/*
boundaryField
{
    freestream
    {
        type            calculated;
        value           uniform 0;
    }

    wall
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }

    #includeEtc "caseDicts/setConstraintTypes" // ALTERAR TAMBÉM
}
*/
// ************************************************************************* //
