Compressible/RAE2822_Shock/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

omegaInlet      10; //2.601665;

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $omegaInlet;

boundaryField
{
    frontandback
    {
        type            empty;
    }
    inlet
    {
        type            freestream;
        freestreamValue uniform $omegaInlet;
    }
    outlet
    {
        type            freestream;
        freestreamValue uniform $omegaInlet;
    }
    airfoil
    {
        type            omegaWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
